In [1]:
import pandas as pd
import numpy as np

In [2]:
names = ['Bob','Jessica','Mary','John','Mel'] 
grades = [76,95,77,78,99] 
bsdegrees = [1,1,0,0,1] 
msdegrees = [2,1,0,0,0] 
phddegrees = [0,1,0,0,0]

In [6]:
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)

In [7]:
df = pd.DataFrame(data=GradeList, columns=['Names','Grades','BS Degree','MS Degree', 'PHD'])

In [8]:
df

     Names  Grades  BS Degree  MS Degree  PHD
0      Bob      76          1          2    0
1  Jessica      95          1          1    1
2     Mary      77          0          0    0
3     John      78          0          0    0
4      Mel      99          1          0    0

In [10]:
df.describe()

          Grades  BS Degree  MS Degree       PHD
count   5.000000   5.000000   5.000000  5.000000
mean   85.000000   0.600000   0.600000  0.200000
std    11.067972   0.547723   0.894427  0.447214
min    76.000000   0.000000   0.000000  0.000000
25%    77.000000   0.000000   0.000000  0.000000
50%    78.000000   1.000000   0.000000  0.000000
75%    95.000000   1.000000   1.000000  0.000000
max    99.000000   1.000000   2.000000  1.000000

In [24]:
 df['BS Degree'].count()  # number of values 
#  df['Grades'].mean()   # arithmetic average 
#  df['Grades'].std()    # standard deviation 
#  df['Grades'].min()    # minimum 
#  df['Grades'].max()    # maximum 
#  df['Grades'].quantile(.25)  # first quartile  
#  df['Grades'].quantile(.5)   # second quartile  
#  df['Grades'].quantile(.75)  # third quartile

5

In [25]:
df.count()

Names        5
Grades       5
BS Degree    5
MS Degree    5
PHD          5
dtype: int64

In [26]:
df.mean()

Grades       85.0
BS Degree     0.6
MS Degree     0.6
PHD           0.2
dtype: float64

In [27]:
df.median()

Grades       78.0
BS Degree     1.0
MS Degree     0.0
PHD           0.0
dtype: float64

In [28]:
df.std()

Grades       11.067972
BS Degree     0.547723
MS Degree     0.894427
PHD           0.447214
dtype: float64

In [29]:
df.mode()

     Names  Grades  BS Degree  MS Degree  PHD
0      Bob      76        1.0        0.0  0.0
1  Jessica      77        NaN        NaN  NaN
2     John      78        NaN        NaN  NaN
3     Mary      95        NaN        NaN  NaN
4      Mel      99        NaN        NaN  NaN

In [30]:
df.var()

Grades       122.5
BS Degree      0.3
MS Degree      0.8
PHD            0.2
dtype: float64